MikroElektronika/core_packages/ARM/gcc_clang/system/src/ti/mspm0l13/thirdparty/mspm0l13/ti/devices/msp/peripherals/hw_i2s.h
/* I2S_WCLKSRC Bits */
/* I2S_WCLKSRC[WBCLKSRC] Bits */
#define I2S_WCLKSRC_WBCLKSRC_OFS                 (0)                             /* !< WBCLKSRC Offset */
#define I2S_WCLKSRC_WBCLKSRC_MASK                ((uint32_t)0x00000003U)         /* !< This field selects WCLK/BCLK source
                                                                                    for I2S. */
#define I2S_WCLKSRC_WBCLKSRC_NONE                ((uint32_t)0x00000000U)         /* !< None ('0') */
#define I2S_WCLKSRC_WBCLKSRC_EXT                 ((uint32_t)0x00000001U)         /* !< External WCLK generator, from pad */
#define I2S_WCLKSRC_WBCLKSRC_INT                 ((uint32_t)0x00000002U)         /* !< Internal WCLK generator, from
                                                                                    module PRCM */
/* I2S_WCLKSRC[WCLKINV] Bits */
#define I2S_WCLKSRC_WCLKINV_OFS                  (2)                             /* !< WCLKINV Offset */
#define I2S_WCLKSRC_WCLKINV_MASK                 ((uint32_t)0x00000004U)         /* !< This field Inverts WCLK source (pad
                                                                                    or internal). */
#define I2S_WCLKSRC_WCLKINV_NOT_INVERTED         ((uint32_t)0x00000000U)         /* !< Source is not intverted */
#define I2S_WCLKSRC_WCLKINV_INVERTED             ((uint32_t)0x00000004U)         /* !< Source is inverted */

/* I2S_DIRCFG Bits */
/* I2S_DIRCFG[AD0] Bits */
#define I2S_DIRCFG_AD0_OFS                       (0)                             /* !< AD0 Offset */
#define I2S_DIRCFG_AD0_MASK                      ((uint32_t)0x00000003U)         /* !< The field configures the AD0 data
                                                                                    pin direction */
#define I2S_DIRCFG_AD0_DIS                       ((uint32_t)0x00000000U)         /* !< Not in use (disabled) */
#define I2S_DIRCFG_AD0_IN                        ((uint32_t)0x00000001U)         /* !< Input */
#define I2S_DIRCFG_AD0_OUT                       ((uint32_t)0x00000002U)         /* !< Output */
/* I2S_DIRCFG[AD1] Bits */
#define I2S_DIRCFG_AD1_OFS                       (4)                             /* !< AD1 Offset */
#define I2S_DIRCFG_AD1_MASK                      ((uint32_t)0x00000030U)         /* !< The field configures the AD1 data
                                                                                    pin direction */
#define I2S_DIRCFG_AD1_DIS                       ((uint32_t)0x00000000U)         /* !< Not in use (disabled) */
#define I2S_DIRCFG_AD1_IN                        ((uint32_t)0x00000010U)         /* !< Input */
#define I2S_DIRCFG_AD1_OUT                       ((uint32_t)0x00000020U)         /* !< Output */

/* I2S_TXDATA Bits */
/* I2S_TXDATA[DATA] Bits */
#define I2S_TXDATA_DATA_OFS                      (0)                             /* !< DATA Offset */
#define I2S_TXDATA_DATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Data Transmitted or Received  Data
                                                                                    that is to be transmitted via the  is
                                                                                    written to this field.  When read,
                                                                                    this field contains the data that was
                                                                                    received by the . */
#define I2S_TXDATA_DATA_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S_TXDATA_DATA_MAXIMUM                  ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* I2S_RXDATA Bits */
/* I2S_RXDATA[DATA] Bits */
#define I2S_RXDATA_DATA_OFS                      (0)                             /* !< DATA Offset */
#define I2S_RXDATA_DATA_MASK                     ((uint32_t)0xFFFFFFFFU)         /* !< Received Data.  When read, this
                                                                                    field contains the data that was
                                                                                    received by the . */
#define I2S_RXDATA_DATA_MINIMUM                  ((uint32_t)0x00000000U)         /* !< Smallest value */
#define I2S_RXDATA_DATA_MAXIMUM                  ((uint32_t)0xFFFFFFFFU)         /* !< Highest possible value */

/* I2S_WMASK0 Bits */
/* I2S_WMASK0[MASK] Bits */
#define I2S_WMASK0_MASK_OFS                      (0)                             /* !< MASK Offset */
#define I2S_WMASK0_MASK_MASK                     ((uint32_t)0x000000FFU)         /* !< Bit-mask indicating valid channels
                                                                                    in a frame on AD0.  In single-phase
                                                                                    mode, each bit represents one
                                                                                    channel, starting with LSB for the
                                                                                    first word in the frame. A frame can
                                                                                    contain up to 8/16 channels based on
                                                                                    SoC configuration.  Channels that are
                                                                                    not included in the mask will not be
                                                                                    sampled nor stored in memory; data
                                                                                    clocked out in these slots is as per
                                                                                    configured EMPTYSLOTOUTPUT.  In
                                                                                    dual-phase mode, only the two LSBs
                                                                                    are considered. For a stereo
                                                                                    configuration, set both bits. For a
                                                                                    mono configuration, set bit 0 only.
                                                                                    In mono mode, only channel 0 will be
                                                                                    sampled and stored to memory, and
                                                                                    channel 0 will be repeated when
                                                                                    clocked out.  In mono mode, only
                                                                                    channel 0 will be sampled and stored
                                                                                    to memory, and channel 0 will be
                                                                                    repeated in the second phase when
                                                                                    clocked out.  If all bits are zero,
                                                                                    no input words will be stored to
                                                                                    memory, and the output data lines
                                                                                    will be constant '0'. This can be
                                                                                    utilized when PWM debug output is
                                                                                    desired without any actively used
                                                                                    output pins. */

